[
  {
    "id": "payment_issue",
    "type": "normal",
    "messages": [
      {
        "role": "client",
        "text": "Привіт, у мене проблема з оплатою. Намагаюся оплатити замовлення, але картка не проходить, постійно видає помилку."
      },
      {
        "role": "agent",
        "text": "Доброго дня! Розумію, що це може бути неприємно. Я з радістю допоможу вам розібратися з цією ситуацією. Будь ласка, чи могли б ви надати номер вашого замовлення або електронну адресу, з якою ви робили покупку?"
      },
      {
        "role": "client",
        "text": "Так, звісно. Номер замовлення #78901. Моя електронна пошта: [email protected]"
      },
      {
        "role": "agent",
        "text": "Дякую за інформацію. Дозвольте мені перевірити деталі. Хвилиночку, будь ласка. Бачу, що ви намагалися здійснити оплату карткою Mastercard, але транзакція була відхилена. Ви отримували якесь конкретне повідомлення про помилку на екрані?"
      },
      {
        "role": "client",
        "text": "Так, писало щось на кшталт 'Транзакцію відхилено' або 'Перевірте дані картки'. Але я все перевіряв, цифри точно правильні."
      },
      {
        "role": "agent",
        "text": "Зрозуміло. Таке повідомлення може виникати з різних причин: іноді це тимчасовий збій у банку-емітенті, ліміт на транзакцію, або навіть технічна особливість системи безпеки. Чи не могли б ви підтвердити останні 4 цифри картки, яку ви використовували, щоб я міг перевірити інформацію з нашого боку?"
      },
      {
        "role": "client",
        "text": "Останні 4 цифри: 8765."
      },
      {
        "role": "agent",
        "text": "Дякую. Перевірив з нашого боку. Система показує відхилення без конкретної причини від банку. Таке інколи трапляється, і може бути пов'язано з тимчасовим блокуванням з боку вашого банку для великих покупок або нових продавців. Ми можемо спробувати кілька варіантів: або ви спробуєте оплатити ще раз через 5-10 хвилин, можливо, через інший браузер, або я можу спробувати ініціювати платіж з нашого боку, надіславши вам нове посилання для оплати. Як вам зручніше?"
      },
      {
        "role": "client",
        "text": "О, якщо ви можете надіслати нове посилання, це було б чудово! Бо я вже кілька разів пробував, і нічого."
      },
      {
        "role": "agent",
        "text": "Чудово! Я щойно створив та надіслав вам нове, захищене посилання для оплати на вашу електронну пошту: [email protected] Будь ласка, перевірте свою скриньку, включно зі спамом, і спробуйте здійснити платіж за цим посиланням. Воно дійсне протягом 30 хвилин."
      },
      {
        "role": "client",
        "text": "Добре, зараз перевірю... Так, бачу листа! Пробую оплатити..."
      },
      {
        "role": "client",
        "text": "Ура! Оплата успішно пройшла! Дякую вам величезне, ви мене врятували!"
      },
      {
        "role": "agent",
        "text": "Це просто чудова новина! Я дуже радий, що ми змогли успішно вирішити це питання. Ваше замовлення #78901 тепер повністю оплачене і готове до обробки. Чи можу я ще чимось допомогти вам сьогодні?"
      },
      {
        "role": "client",
        "text": "Ні, дякую, це все. Ви дуже допомогли. Гарного дня!"
      },
      {
        "role": "agent",
        "text": "Вам також гарного дня! Будь ласка, звертайтеся, якщо виникнуть інші запитання. До побачення!"
      }
    ]
  },
  {
    "id": "tech_error",
    "type": "normal",
    "messages": [
      {
        "role": "client",
        "text": "Привіт, мій додаток 'MyBank' не завантажується. Просто висить на логотипі і нічого не відбувається."
      },
      {
        "role": "agent",
        "text": "Вітаю! Я Юлія, спеціаліст технічної підтримки. Мені шкода чути про вашу проблему з додатком 'MyBank'. Щоб я могла допомогти, будь ласка, уточніть, на якому пристрої (модель телефону/планшета) ви намагаєтеся його запустити та яка у вас версія операційної системи?"
      },
      {
        "role": "client",
        "text": "Привіт, Юліє! Це Samsung Galaxy S22, і версія Android 13."
      },
      {
        "role": "agent",
        "text": "Дякую за інформацію. Давайте спробуємо почати з кількох базових кроків. По-перше, будь ласка, спробуйте повністю закрити додаток 'MyBank' (переконайтесь, що він не працює у фоновому режимі) і потім спробуйте запустити його знову. Якщо це не допоможе, спробуйте перезавантажити ваш телефон."
      },
      {
        "role": "client",
        "text": "Добре, я закрив додаток і спробував знову – без результату. Перезавантажив телефон. Запускаю 'MyBank'... Ні, все одно та ж ситуація, просто висить на логотипі."
      },
      {
        "role": "agent",
        "text": "Зрозумів. Дякую, що спробували ці кроки. У такому випадку, давайте спробуємо очистити кеш та дані додатку. Це часто допомагає вирішити проблеми із завантаженням, якщо є пошкоджені файли кешу. Для цього вам потрібно перейти в 'Налаштування' -> 'Додатки' -> знайти 'MyBank' -> 'Пам'ять' -> і натиснути 'Очистити кеш', а потім 'Очистити дані'. Після цього спробуйте запустити додаток знову."
      },
      {
        "role": "client",
        "text": "Гаразд, я зараз це зроблю... Зайшов у Налаштування, знайшов MyBank, очистив кеш і дані. Тепер спробую запустити... Ого! Він завантажився! Вже бачу головний екран! Здається, спрацювало!"
      },
      {
        "role": "agent",
        "text": "Чудово! Я дуже рада, що це допомогло вирішити вашу проблему. Очищення даних додатку часто є ефективним рішенням, коли виникають такі складнощі із завантаженням. Чи можу я ще чимось вам допомогти сьогодні?"
      },
      {
        "role": "client",
        "text": "Ні, Юліє, дякую! Ви дуже допомогли. Я вже думав, що доведеться перевстановлювати все і втрачати налаштування. Величезне дякую за покрокову допомогу!"
      },
      {
        "role": "agent",
        "text": "Будь ласка! Завжди раді допомогти. Якщо виникнуть інші питання або проблеми, не соромтеся звертатися знову. Гарного вам дня!"
      }
    ]
  },
  {
    "id": "account_access",
    "type": "normal",
    "messages": [
      {
        "role": "client",
        "text": "Привіт, не можу зайти в свій акаунт. Забув пароль і не пам'ятаю його зовсім."
      },
      {
        "role": "agent",
        "text": "Доброго дня! Розумію, це може бути неприємно. Не хвилюйтеся, я допоможу вам відновити доступ. Щоб я міг знайти ваш акаунт, будь ласка, назвіть електронну пошту або ім'я користувача, які ви використовували при реєстрації."
      },
      {
        "role": "client",
        "text": "Так, моя електронна пошта – [client_email@example.com]."
      },
      {
        "role": "agent",
        "text": "Дякую. Я знайшов ваш акаунт. Для скидання пароля ми можемо надіслати посилання для відновлення безпосередньо на вашу електронну пошту [client_email@example.com]. Чи бажаєте ви скористатися цим методом?"
      },
      {
        "role": "client",
        "text": "Так, це ідеально, будь ласка, надішліть."
      },
      {
        "role": "agent",
        "text": "Чудово. Я щойно надіслав лист з посиланням для скидання пароля на [client_email@example.com]. Будь ласка, перевірте свою вхідну скриньку. Якщо ви не бачите його одразу, перевірте також папки 'Спам' або 'Небажана пошта'. Посилання буде активним протягом 15 хвилин."
      },
      {
        "role": "client",
        "text": "Добре, дивлюся... Ага, бачу лист! Прийшов. Дякую."
      },
      {
        "role": "agent",
        "text": "Відмінно! Будь ласка, перейдіть за посиланням, встановіть новий надійний пароль і дайте мені знати, коли ви успішно увійдете в акаунт."
      },
      {
        "role": "client",
        "text": "Все зроблено! Пароль успішно змінений, і я вже ввійшов у свій акаунт. Дуже дякую за швидку і ефективну допомогу!"
      },
      {
        "role": "agent",
        "text": "Радий чути, що все вдалося і ваш доступ відновлено! Чи є ще щось, чим я можу вам допомогти сьогодні?"
      },
      {
        "role": "client",
        "text": "Ні, це все. Дуже дякую! Ви мене врятували. Гарного дня!"
      },
      {
        "role": "agent",
        "text": "Вам також гарного дня! Будь ласка, звертайтеся, якщо виникнуть інші питання. До побачення!"
      }
    ]
  },
  {
    "id": "tariff_question",
    "type": "normal",
    "messages": [
      {
        "role": "client",
        "text": "Добрий день! Хотів би уточнити, що саме входить у мій поточний тарифний план. Здається, він називається «Вигідний +», але я не впевнений на 100%."
      },
      {
        "role": "agent",
        "text": "Вітаю! Звісно, я з радістю допоможу вам розібратися з вашим тарифом. Для перевірки інформації, будь ласка, назвіть ваш номер телефону або номер особового рахунку."
      },
      {
        "role": "client",
        "text": "Мій номер: 097-ХХХ-ХХ-ХХ."
      },
      {
        "role": "agent",
        "text": "Дякую. Перевіряю інформацію... Так, ваш тарифний план дійсно називається «Вигідний +». Ось повний список того, що в нього входить щомісяця:\n\n*   **Безлімітні дзвінки** у мережі вашого оператора.\n*   **200 хвилин** на дзвінки на номери інших мобільних операторів по Україні та на міські номери.\n*   **100 SMS** на всі мобільні номери по Україні.\n*   **20 ГБ мобільного інтернету** на будь-які потреби.\n*   **Безлімітний трафік** на популярні месенджери (Viber, Telegram, WhatsApp) та соціальні мережі (Facebook, Instagram, TikTok) – цей трафік не списується з ваших основних 20 ГБ.\n*   **100 МБ роумінгу** та **10 хвилин на дзвінки в роумінгу** в країнах Європи.\n\nАбонентська плата за цей тариф складає 150 грн/місяць і знімається 1-го числа кожного місяця."
      },
      {
        "role": "client",
        "text": "Ого, це досить детально! Дякую. А якщо я використаю 200 хвилин на інші мережі, як тарифікуватимуться наступні дзвінки?"
      },
      {
        "role": "agent",
        "text": "Після вичерпання 200 хвилин на дзвінки на інші мережі та міські номери, кожна наступна хвилина буде тарифікуватися по 0.60 грн/хв. Ви завжди можете перевірити залишок своїх пакетів за допомогою нашого мобільного додатку або USSD-запитом *111#."
      },
      {
        "role": "client",
        "text": "Зрозуміло. І безліміт на месенджери та соцмережі дійсно окремо від 20 ГБ, так? Це дуже зручно."
      },
      {
        "role": "agent",
        "text": "Саме так! Трафік на ці сервіси є повністю безлімітним і ніяк не впливає на ваш основний пакет 20 ГБ. Ми зробили це для вашої максимальної зручності та щоб ви завжди залишалися на зв'язку."
      },
      {
        "role": "client",
        "text": "Чудово! Дуже дякую за таку вичерпну інформацію, тепер все стало набагато зрозуміліше. Я задоволений своїм тарифом."
      },
      {
        "role": "agent",
        "text": "Радий був допомогти вам! Якщо у вас виникнуть інші питання або знадобиться додаткова консультація, будь ласка, звертайтеся. Гарного вам дня!"
      }
    ]
  },
  {
    "id": "refund",
    "type": "normal",
    "messages": [
      {
        "role": "client",
        "text": "Добрий день! Хотів би дізнатися, як оформити повернення коштів за моє замовлення."
      },
      {
        "role": "agent",
        "text": "Вітаю! Звісно, з радістю допоможу вам із цим питанням. Щоб я міг знайти ваше замовлення та перевірити інформацію, будь ласка, назвіть номер замовлення або електронну пошту, яку ви використовували при оформленні."
      },
      {
        "role": "client",
        "text": "Мій номер замовлення #123456. Електронна пошта: client_email@example.com. Я замовляв набір посуду, але передумав, і він мені не потрібен."
      },
      {
        "role": "agent",
        "text": "Дякую за інформацію! Перевіряю... Так, бачу ваше замовлення на набір посуду. Згідно з нашою політикою повернень, ви можете оформити повернення, якщо товар не був у використанні та зберігає товарний вигляд. Це ваш випадок?"
      },
      {
        "role": "client",
        "text": "Так, саме так. Упаковку навіть не відкривав."
      },
      {
        "role": "agent",
        "text": "Чудово. Я можу ініціювати повернення коштів. Замовлення було оплачене карткою на суму 1500 грн. Ви бажаєте, щоб кошти були повернені на ту саму платіжну картку?"
      },
      {
        "role": "client",
        "text": "Так, будь ласка. На ту ж картку."
      },
      {
        "role": "agent",
        "text": "Добре. Я щойно оформив запит на повернення коштів за замовлення #123456. Ви отримаєте підтвердження на вашу електронну пошту. Зазвичай, кошти надходять на ваш рахунок протягом 3-5 робочих днів, залежно від регламенту вашого банку."
      },
      {
        "role": "client",
        "text": "Дуже дякую! Це було дуже швидко та зручно. Я задоволений вашою допомогою!"
      },
      {
        "role": "agent",
        "text": "Будь ласка! Радий, що зміг допомогти. Якщо у вас виникнуть ще питання, звертайтеся в будь-який час. Гарного дня!"
      }
    ]
  },
  {
    "id": "payment_conflict",
    "type": "conflict",
    "messages": [
      {
        "role": "client",
        "text": "Це просто обурливо! Я заплатив за Преміум підписку вчора ввечері, а вона досі не активна! Гроші списалися, а сервіс не працює. Що це за безлад?!"
      },
      {
        "role": "agent",
        "text": "Добрий день! Перепрошую за незручності, що виникли. Розумію ваше розчарування. Будь ласка, надайте мені вашу електронну пошту, яку ви використовували для реєстрації, та, якщо є, ідентифікатор транзакції. Я негайно перевірю інформацію."
      },
      {
        "role": "client",
        "text": "Моя пошта: test.user@example.com. Ідентифікатор транзакції: PAY-123456789. Я ж мав отримати доступ відразу! Це просто абсурд! І чому я маю витрачати свій час на це? Це ж ваша помилка, вірно?"
      },
      {
        "role": "agent",
        "text": "Дякую за інформацію. Перевіряю... Бачу, що платіж надійшов, але, схоже, виникла затримка з автоматичною активацією. Це іноді трапляється під час пікового навантаження. Мені потрібно буде створити запит для технічного відділу, щоб вони вручну активували вашу підписку. Це може зайняти до 24 годин."
      },
      {
        "role": "client",
        "text": "24 години?! Ви серйозно?! Я платив за миттєвий доступ, а не за те, щоб чекати ще добу! І ви так і не відповіли на моє питання, чому я маю витрачати свій час на виправлення ваших помилок? Це просто непрофесійно!"
      },
      {
        "role": "agent",
        "text": "Мої щирі вибачення. Ви маєте повне право на розчарування. Я розумію, що чекати ще 24 години — це неприйнятно, і це дійсно наша помилка, за яку ми несемо відповідальність. Я вже створив терміновий запит до технічного відділу, і попросив їх прискорити процес. Також, як компенсацію за незручності, я можу запропонувати вам додатковий місяць Преміум підписки безкоштовно після активації. Ми цінуємо ваш час і дуже шкодуємо, що виникла така ситуація."
      },
      {
        "role": "client",
        "text": "Додатковий місяць? Зараз мені це мало допомагає. Я хотів користуватися сервісом ЗАРАЗ. Це просто підриває довіру. Я подумаю про скасування підписки, якщо це не буде вирішено негайно. Мені потрібен доступ, а не обіцянки. Я очікую на активацію значно раніше, ніж через 24 години."
      }
    ]
  },
  {
    "id": "rude_agent",
    "type": "problem",
    "messages": [
      {
        "role": "client",
        "text": "Добрий день. У мене проблема з вашим додатком. Після останнього оновлення він перестав запускатися, просто вилітає при відкритті. Я вже і перевстановлював, і телефон перезавантажував – нічого не допомагає."
      },
      {
        "role": "agent",
        "text": "І що мені з цим робити? У вас одного не працює? У нас мільйони користувачів, і ніхто не скаржиться. Ви взагалі впевнені, що робите все правильно?"
      },
      {
        "role": "client",
        "text": "Я впевнений! До оновлення все працювало ідеально, а тепер я не можу користуватися оплаченим сервісом. Мій телефон повністю відповідає системним вимогам."
      },
      {
        "role": "agent",
        "text": "Ну, значить, проблема у вас, а не в нас. Ми нічого не міняли, крім покращень. Може, ваш телефон застарів чи ви самі щось там налаштували неправильно? Це не наш головний біль."
      },
      {
        "role": "client",
        "text": "Мій телефон новий, і я нічого не налаштовував! Це якась технічна помилка з вашого боку, і я очікую допомоги або хоча б пояснень. Я заплатив за підписку!"
      },
      {
        "role": "agent",
        "text": "Слухайте, у нас немає часу розбиратися з кожним унікальним випадком. Якщо у всіх працює, а у вас ні, то це ваша проблема. Чекайте наступного оновлення, може, воно якось само собою виправить вашу специфічну ситуацію. Закриваю звернення."
      },
      {
        "role": "client",
        "text": "Ви жартуєте? Ви навіть не намагалися допомогти! Це просто обурливо! Я вимагаю повернення коштів та буду скаржитися на таку підтримку! Ви нічого не вирішили!"
      }
    ]
  },
  {
    "id": "wrong_info",
    "type": "problem",
    "messages": [
      {
        "role": "client",
        "text": "Доброго дня! Підкажіть, будь ласка, скільки коштує тарифний план 'Оптимальний' і що в нього входить?"
      },
      {
        "role": "agent",
        "text": "Доброго дня! Звісно, я вам допоможу. Тарифний план 'Оптимальний' коштує 99 гривень на місяць. Це дуже вигідна пропозиція!"
      },
      {
        "role": "client",
        "text": "99 гривень? Це звучить досить недорого. А що саме я отримую за цю суму? Скільки хвилин, гігабайтів?"
      },
      {
        "role": "agent",
        "text": "Так, абсолютно вірно, лише 99 гривень! За цю абонплату ви отримуєте безлімітні дзвінки всередині мережі, 150 хвилин на дзвінки по Україні, а також 25 ГБ мобільного інтернету."
      },
      {
        "role": "client",
        "text": "Ого, 25 ГБ інтернету за 99 грн – це чудово! А як щодо SMS, вони входять у пакет?"
      },
      {
        "role": "agent",
        "text": "Саме так, 25 ГБ! Щодо SMS, то в цьому тарифі надається 100 SMS-повідомлень на всі номери по Україні без додаткової плати."
      },
      {
        "role": "client",
        "text": "Зрозуміло. Дякую за таку детальну інформацію! Це дуже приваблива пропозиція."
      },
      {
        "role": "agent",
        "text": "Завжди радий допомогти! Якщо у вас виникнуть додаткові питання, звертайтеся в будь-який час."
      }
    ]
  },
  {
    "id": "hidden_dissatisfaction_1",
    "type": "easter_egg",
    "messages": [
      {
        "role": "client",
        "text": "Доброго дня. Я хотіла б оформити повернення коштів за підписку, яку я не використовувала. Вона автоматично продовжилася, а мені вже не потрібна."
      },
      {
        "role": "agent",
        "text": "Вітаю! Розумію вашу ситуацію. Щоб я міг вам допомогти, будь ласка, надайте номер вашого замовлення або електронну пошту, прив'язану до облікового запису."
      },
      {
        "role": "client",
        "text": "Так, звісно. Мій номер замовлення 123456789, а пошта example@mail.com."
      },
      {
        "role": "agent",
        "text": "Дякую за інформацію. Я бачу вашу підписку. Вона дійсно була автоматично поновлена. Я зараз фіксую ваш запит на повернення."
      },
      {
        "role": "client",
        "text": "Чудово. І як швидко я отримаю кошти? Чи мені потрібно ще щось зробити?"
      },
      {
        "role": "agent",
        "text": "Ваш запит зареєстрований. Я вже передав інформацію до нашого фінансового відділу для розгляду. Зазвичай, вони опрацьовують такі звернення. Вам не потрібно нічого додатково робити з вашого боку."
      },
      {
        "role": "client",
        "text": "Тобто, мені просто чекати? А коли приблизно буде результат?"
      },
      {
        "role": "agent",
        "text": "Так, саме так. Фінансовий відділ перевірить всі деталі та прийме рішення. Ми будемо тримати вас в курсі щодо статусу вашого запиту. Якщо буде потреба в додатковій інформації, ми обов'язково зв'яжемося з вами."
      },
      {
        "role": "client",
        "text": "Зрозуміло. Дякую за допомогу."
      },
      {
        "role": "agent",
        "text": "Завжди раді допомогти! Якщо у вас виникнуть інші питання, звертайтеся."
      }
    ]
  },
  {
    "id": "hidden_dissatisfaction_2",
    "type": "easter_egg",
    "messages": [
      {
        "role": "client",
        "text": "Доброго дня. Не можу увійти до свого акаунту."
      },
      {
        "role": "agent",
        "text": "Доброго дня! Які саме труднощі виникли? Опишіть, будь ласка, детальніше."
      },
      {
        "role": "client",
        "text": "Я намагався скинути пароль, але нічого не спрацювало, система видає помилку або каже, що акаунт заблоковано. Мені терміново потрібен доступ, бо там важлива інформація."
      },
      {
        "role": "agent",
        "text": "Зрозумів. Для ідентифікації, будь ласка, назвіть адресу електронної пошти, до якої прив'язаний акаунт, та ваше повне ім'я."
      },
      {
        "role": "client",
        "text": "email@example.com, [Ім'я Прізвище]."
      },
      {
        "role": "agent",
        "text": "Дякую. Перевіряю інформацію... [Пауза] Дякую за очікування. Я бачу, що проблема стосується безпосередньо системних налаштувань доступу до облікового запису. На жаль, це питання виходить за рамки моєї компетенції і потребує втручання нашого відділу технічної підтримки."
      },
      {
        "role": "client",
        "text": "Тобто ви зараз мені не допоможете? Мені здавалося, що це типова ситуація, і я сподівався вирішити її одразу. Минулого разу, коли була схожа проблема, мене вже перенаправляли, і це зайняло досить багато часу."
      },
      {
        "role": "agent",
        "text": "На жаль, для глибокого аналізу та вирішення цієї проблеми необхідні спеціальні інструменти та дозволи, які є тільки у фахівців технічної підтримки. Я створив запит і передаю його їм. Очікуйте, будь ласка, на зворотний зв'язок електронною поштою протягом 24 годин."
      },
      {
        "role": "client",
        "text": "24 години... Ну добре, зрозумів. Дякую. Сподіваюся, вони швидко розберуться цього разу."
      },
      {
        "role": "agent",
        "text": "Я зробив усе можливе, щоб ваш запит був переданий максимально швидко. Чи можу я ще чимось допомогти?"
      },
      {
        "role": "client",
        "text": "Ні, дякую. Більше нічим."
      },
      {
        "role": "agent",
        "text": "Гаразд. Бажаю успішного вирішення питання та гарного дня!"
      }
    ]
  }
]